| SPARQL |

  --------------------
SPARQL is a collection of syntax and semantics in the form of a query language for RDF (Resource Description Framework).
--------------------
Writing Queries

1. Writing Simple Queries	
	- Data
		<http://example.org/book/book1> <http://purl.org/dc/elements/1.1/title> "SPARQL Tutorial" .
	- Query
		SELECT ?title
		WHERE
		{
		  <http://example.org/book/book1> <http://purl.org/dc/elements/1.1/title> ?title .
		} 
	- Result
		title > "SPARQL Tutorial"

2. Multiple Matches
	- Data
		@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
		_:a  foaf:name   "Johnny Lee Outlaw" .
		_:a  foaf:mbox   <mailto:jlow@example.com> .
		_:b  foaf:name   "Peter Goodguy" .
		_:b  foaf:mbox   <mailto:peter@example.org> .
		_:c  foaf:mbox   <mailto:carol@example.org> .
	- Query
		PREFIX foaf:   <http://xmlns.com/foaf/0.1/>
		SELECT ?name ?mbox
		WHERE
		  { ?x foaf:name ?name .
		    ?x foaf:mbox ?mbox }
	- Result
		 _:a foaf:name  "Johnny Lee Outlaw" .
		 _:a foaf:box   <mailto:jlow@example.com> .
		 
		 _:b foaf:name  "Peter Goodguy" .
		 _:b foaf:box   <mailto:peter@example.org> .
